// =========================================================================
// CSS・SCSSの読み込み
// =========================================================================

// Simplebar（カスタムスクロールバー）の基本スタイル
import 'simplebar-vue/dist/simplebar.min.css';
// アプリ全体のグローバルスタイル
import './assets/scss/main.scss';

// =========================================================================
// Vue と プラグインの読み込み
// =========================================================================

import { createApp } from 'vue';
import { createPinia } from 'pinia';
import App from './App.vue';
import router from './router';

// =========================================================================
// アプリケーションの初期化とマウント
// =========================================================================

// Vueアプリケーションのインスタンスを作成
const app = createApp(App);

// プラグイン（Piniaによる状態管理と、Vue Routerによる画面遷移）をアプリに登録
app.use(createPinia());
app.use(router);

// 'index.html' の中にある <div id="app"> に、Vueアプリを描画（マウント）する
app.mount('#app');